11/data/attachments/a865b73212db9c12.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bdc7e9cd-193a-40a1-a8be-31e94496bd4f</nif:username>
            <nif:friendToBeAdded>Christopher_war_Friend_4665_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>